app/controllers/friends_controller.rb

  def update
    respond_to do |format|
      if @friend.update(friend_params)
---
UPDATE "friends" SET "first_name" = ?, "updated_at" = ?, "user_id" = ? WHERE "friends"."id" = ?  [["first_name", "Trupt"], ["updated_at", "2022-10-13 07:40:08.480541"], ["user_id", 3], ["id", 24]]